badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
#include "board.h"
#include "driver/dedic_gpio.h"
#include "driver/gpio.h"
#include "driver/i2c.h"
#include "epaper.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_sleep.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_vfs_fat.h"
#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "hextools.h"
#include "managed_i2c.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "pax_codecs.h"
#include "pax_gfx.h"
#include "resources.h"
#include "riscv/rv_utils.h"
#include "sdkconfig.h"
#include "sdmmc_cmd.h"
#include "soc/gpio_struct.h"

#include <inttypes.h>
#include <stdio.h>

#include <esp_err.h>
#include <esp_log.h>
#include <esp_system.h>
#include <esp_vfs_fat.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <nvs.h>
#include <nvs_flash.h>
#include <sdkconfig.h>
#include <sdmmc_cmd.h>
#include <string.h>
#include <time.h>

#include "ch32.h"

#define I2C_REG_FW_VERSION 0
#define I2C_REG_LED        4
#define I2C_REG_BTN        8

#define LutFull 0
#define Lut8s 1
#define Lut4s 2
#define Lut1s 3
#define LutBlack 4
#define LutRed 5
#define LutWhite 6
#define LutRedfromBlack 7

#define MainMenuhub 0
#define MainMenubattleship 1
#define MainMenuBadgetag 2
#define MainMenuSettings 3
#define MainMenuCredits 4

static char const *TAG = "main";

extern pax_buf_t     gfx;
extern sdmmc_card_t *card;
extern hink_t        epaper;


uint8_t lut_test[] = {
    0x08,  // 0
    0x99,  // 1
    0x21,  // 2
    0x44,  // 3
    0x40,  // 4
    0x01,  // 5
    0x00,  // 6
    0x10,  // 7
    0x99,  // 8
    0x21,  // 9
    0xa0,  // 10
    0x20,  // 11
    0x20,  // 12
    0x00,  // 13
    0x88,  // 14
    0x99,  // 15
    0x21,  // 16
    0x44,  // 17
    0x2b,  // 18
    0x2f,  // 19
    0x00,  // 20
    0x88,  // 21
    0x99,  // 22
    0x21,  // 23
    0x44,  // 24
    0x2b,  // 25
    0x2f,  // 26
    0x00,  // 27
    0x00,  // 28
    0x00,  // 29
    0x12,  // 30
    0x40,  // 31
    0x00,  // 32
    0x00,  // 33
    0x00,  // 34

    //  TPxA  TPxB  TPxC  TPxD  RPx
    0x36,
    0x30,
    0x33,
    0x00,
    0x01,
    0x02,
    0x02,
    0x02,
    0x02,
    0x13,
    0x01,
    0x16,
    0x01,
    0x16,
    0x04,
    0x02,
    0x0b,
    0x10,
    0x00,
    0x03,
    0x06,
    0x04,
    0x02,
    0x2b,
    0x04,
    0x14,
    0x04,
    0x23,
    0x02,
    0x03,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    0x13,  // VGH
    0x3c,  // VSH1
    0xc0,  // VSH2
    0x2e,  // VSL
    0x30,  // Frame 1
    0x0a,  // Frame 2
};
lut7_t *lut = (lut7_t *)lut_test;

uint8_t buttons[5];
int delaySM = 1;
int delaySMflag = 0;
int delayLED = 0;
int delayLEDflag = 0;
int MainMenustatemachine = MainMenuhub;
int MainMenuchangeflag = 1;
char inputletter = NULL;
char playername[20] = "";
int specialcharacterselect = 0;
char specialcharactersicon[4][20] = {"A/!", "CAPS", "!?", "<|>"};

esp_err_t TextInputTelegraph(void);

int DisplaySelectedLetter(int _selectedletter)
{
    delayLED = 500;
    delayLEDflag = 1;
    return _selectedletter;
}

void DisplayDebugCenterlines(void) // in black
{
    pax_draw_line(&gfx, 1, 147, 0, 147, 127);
    pax_draw_line(&gfx, 1, 148, 0, 148, 127);
    pax_draw_line(&gfx, 1, 0, 63, 295, 63);
    pax_draw_line(&gfx, 1, 0, 64, 295, 64);
}

void DisplayDebugSwitchesBoxes(void) // in black
{
    pax_outline_rect(&gfx, 1, 0, 114, 52, 14); // Switch 1
    // pax_draw_rect(&gfx, 0, 1, 115, 50, 12);

    pax_outline_rect(&gfx, 1, 61, 114, 52, 14); // Switch 2
    // pax_draw_rect(&gfx, 0, 62, 115, 50, 12);

    pax_outline_rect(&gfx, 1, 61 * 2, 114, 52, 14); // Switch 3
    // pax_draw_rect(&gfx, 0, 1 + 61 * 2, 115, 50, 12);

    pax_outline_rect(&gfx, 1, 61 * 3, 114, 52, 14); // Switch 4
    // pax_draw_rect(&gfx, 0, 1 + 61 * 3, 115, 50, 12);

    pax_outline_rect(&gfx, 1, 61 * 4, 114, 52, 14); // Switch 5
    // pax_draw_rect(&gfx, 0, 1 + 61 * 4, 115, 50, 12);
}

void DisplaySwitchesBox(int _switch) // in black
{
    pax_outline_rect(&gfx, 1, 61 * _switch, 114, 50, 12);
}

// Position is the X coordinate of the center/left (since it's even) pixel
void DisplayTelegraph(int _colour, int _position)
{
    if (_position < 36)
        _position = 36; // prevent to draw outside of buffer

    // Diamond
    pax_draw_line(&gfx, _colour, _position - 36, 64, _position - 3, 127); // Left to top
    pax_draw_line(&gfx, _colour, _position - 36, 63, _position - 3, 0);   // Left to bottom
    pax_draw_line(&gfx, _colour, _position + 37, 64, _position + 4, 127); // Right to top
    pax_draw_line(&gfx, _colour, _position + 37, 63, _position + 4, 0);   // Right to bottom

    // Letter circles

    pax_outline_circle(&gfx, _colour, _position, 12, 6);

    pax_outline_circle(&gfx, _colour, _position - 8, 27, 6);
    pax_outline_circle(&gfx, _colour, _position + 8, 27, 6);

    pax_outline_circle(&gfx, _colour, _position - 16, 42, 6);
    pax_outline_circle(&gfx, _colour, _position, 42, 6);
    pax_outline_circle(&gfx, _colour, _position + 16, 42, 6);

    pax_outline_circle(&gfx, _colour, _position - 24, 57, 6);
    pax_outline_circle(&gfx, _colour, _position - 8, 57, 6);
    pax_outline_circle(&gfx, _colour, _position + 8, 57, 6);
    pax_outline_circle(&gfx, _colour, _position + 24, 57, 6);

    pax_outline_circle(&gfx, _colour, _position - 24, 71, 6);
    pax_outline_circle(&gfx, _colour, _position - 8, 71, 6);
    pax_outline_circle(&gfx, _colour, _position + 8, 71, 6);
    pax_outline_circle(&gfx, _colour, _position + 24, 71, 6);

    pax_outline_circle(&gfx, _colour, _position - 16, 86, 6);
    pax_outline_circle(&gfx, _colour, _position, 86, 6);
    pax_outline_circle(&gfx, _colour, _position + 16, 86, 6);

    pax_outline_circle(&gfx, _colour, _position - 8, 101, 6);
    pax_outline_circle(&gfx, _colour, _position + 8, 101, 6);

    pax_outline_circle(&gfx, _colour, _position, 116, 6);
}

void testaa(void)
{
    while (1)
    {
        vTaskDelay(pdMS_TO_TICKS(10));
        if (delaySMflag == 1)
        {
            vTaskDelay(pdMS_TO_TICKS(delaySM));
            delaySMflag = 0;
        }

        if (delayLEDflag == 1)
        {
            vTaskDelay(pdMS_TO_TICKS(delayLED));
            delayLEDflag = 0;
        }
    }
}

void LUTset(int LUTconfiguration)
{
    switch (LUTconfiguration)
    {
    case LutFull: // uses all groups
        lut->groups[0].repeat = 0x01;
        lut->groups[1].repeat = 0x13;
        lut->groups[2].repeat = 0x04;
        lut->groups[3].repeat = 0x03;
        lut->groups[4].repeat = 0x04;
        lut->groups[5].repeat = 0x03;
        // lut->groups[6].repeat = 0x00;

        lut->groups[0].tp[0] = 0x36;
        lut->groups[0].tp[1] = 0x30;
        lut->groups[0].tp[2] = 0x33;
        lut->groups[0].tp[3] = 0x00;

        lut->groups[1].tp[0] = 0x02;
        lut->groups[1].tp[1] = 0x02;
        lut->groups[1].tp[2] = 0x02;
        lut->groups[1].tp[3] = 0x02;

