badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
        lut->groups[2].tp[0] = 0x01;
        lut->groups[2].tp[1] = 0x16;
        lut->groups[2].tp[2] = 0x01;
        lut->groups[2].tp[3] = 0x16;

        lut->groups[3].tp[0] = 0x02;
        lut->groups[3].tp[1] = 0x0b;
        lut->groups[3].tp[2] = 0x10;
        lut->groups[3].tp[3] = 0x00;

        lut->groups[4].tp[0] = 0x06;
        lut->groups[4].tp[1] = 0x04;
        lut->groups[4].tp[2] = 0x02;
        lut->groups[4].tp[3] = 0x2b;

        lut->groups[5].tp[0] = 0x14;
        lut->groups[5].tp[1] = 0x04;
        lut->groups[5].tp[2] = 0x23;
        lut->groups[5].tp[3] = 0x02;
        break;

    case Lut8s: // uses all groups without repeat
        lut->groups[0].repeat = 0;
        lut->groups[1].repeat = 0;
        lut->groups[2].repeat = 0;
        lut->groups[3].repeat = 0;
        lut->groups[4].repeat = 0;
        lut->groups[5].repeat = 0;
        // lut->groups[6].repeat = 0x00;

        lut->groups[0].tp[0] = 0x36;
        lut->groups[0].tp[1] = 0x30;
        lut->groups[0].tp[2] = 0x33;
        lut->groups[0].tp[3] = 0x00;

        lut->groups[1].tp[0] = 0x02;
        lut->groups[1].tp[1] = 0x02;
        lut->groups[1].tp[2] = 0x02;
        lut->groups[1].tp[3] = 0x02;

        lut->groups[2].tp[0] = 0x01;
        lut->groups[2].tp[1] = 0x16;
        lut->groups[2].tp[2] = 0x01;
        lut->groups[2].tp[3] = 0x16;

        lut->groups[3].tp[0] = 0x02;
        lut->groups[3].tp[1] = 0x0b;
        lut->groups[3].tp[2] = 0x10;
        lut->groups[3].tp[3] = 0x00;

        lut->groups[4].tp[0] = 0x06;
        lut->groups[4].tp[1] = 0x04;
        lut->groups[4].tp[2] = 0x02;
        lut->groups[4].tp[3] = 0x2b;

        lut->groups[5].tp[0] = 0x14;
        lut->groups[5].tp[1] = 0x04;
        lut->groups[5].tp[2] = 0x23;
        lut->groups[5].tp[3] = 0x02;
        break;

    case Lut4s: // uses groups 3,4 and 5 without repeat
        lut->groups[0].repeat = 0;
        lut->groups[1].repeat = 0;
        lut->groups[2].repeat = 0;
        lut->groups[3].repeat = 0;
        lut->groups[4].repeat = 0;
        lut->groups[5].repeat = 0;
        // lut->groups[6].repeat = 0x00;

        lut->groups[0].tp[0] = 0;
        lut->groups[0].tp[1] = 0;
        lut->groups[0].tp[2] = 0;
        lut->groups[0].tp[3] = 0;

        lut->groups[1].tp[0] = 0;
        lut->groups[1].tp[1] = 0;
        lut->groups[1].tp[2] = 0;
        lut->groups[1].tp[3] = 0;

        lut->groups[2].tp[0] = 0;
        lut->groups[2].tp[1] = 0;
        lut->groups[2].tp[2] = 0;
        lut->groups[2].tp[3] = 0;

        lut->groups[3].tp[0] = 0x02;
        lut->groups[3].tp[1] = 0x0b;
        lut->groups[3].tp[2] = 0x10;
        lut->groups[3].tp[3] = 0x00;

        lut->groups[4].tp[0] = 0x06;
        lut->groups[4].tp[1] = 0x04;
        lut->groups[4].tp[2] = 0x02;
        lut->groups[4].tp[3] = 0x2b;

        lut->groups[5].tp[0] = 0x14;
        lut->groups[5].tp[1] = 0x04;
        lut->groups[5].tp[2] = 0x23;
        lut->groups[5].tp[3] = 0x02;
        break;

    case Lut1s: // uses all groups
        lut->groups[0].repeat = 0;
        lut->groups[1].repeat = 0;
        lut->groups[2].repeat = 0;
        lut->groups[3].repeat = 0;
        lut->groups[4].repeat = 0;
        lut->groups[5].repeat = 0;
        // lut->groups[6].repeat = 0x00;

        lut->groups[0].tp[0] = 0;
        lut->groups[0].tp[1] = 0;
        lut->groups[0].tp[2] = 0;
        lut->groups[0].tp[3] = 0;

        lut->groups[1].tp[0] = 0;
        lut->groups[1].tp[1] = 0;
        lut->groups[1].tp[2] = 0;
        lut->groups[1].tp[3] = 0;

        lut->groups[2].tp[0] = 0;
        lut->groups[2].tp[1] = 0;
        lut->groups[2].tp[2] = 0;
        lut->groups[2].tp[3] = 0;

        lut->groups[3].tp[0] = 0x02;
        lut->groups[3].tp[1] = 0x0b;
        lut->groups[3].tp[2] = 0x10;
        lut->groups[3].tp[3] = 0x00;

        lut->groups[4].tp[0] = 0x06;
        lut->groups[4].tp[1] = 0x04;
        lut->groups[4].tp[2] = 0x02;
        lut->groups[4].tp[3] = 0x2b;

        lut->groups[5].tp[0] = 0;
        lut->groups[5].tp[1] = 0;
        lut->groups[5].tp[2] = 0;
        lut->groups[5].tp[3] = 0;
        break;

    case LutWhite: // uses groups 3,4 and 5 without repeat
        lut->groups[0].repeat = 0;
        lut->groups[1].repeat = 0;
        lut->groups[2].repeat = 0;
        lut->groups[3].repeat = 0;
        lut->groups[4].repeat = 0;
        lut->groups[5].repeat = 0;
        // lut->groups[6].repeat = 0x00;

        lut->groups[0].tp[0] = 0;
        lut->groups[0].tp[1] = 0;
        lut->groups[0].tp[2] = 0;
        lut->groups[0].tp[3] = 0;

        lut->groups[1].tp[0] = 0;
        lut->groups[1].tp[1] = 0;
        lut->groups[1].tp[2] = 0;
        lut->groups[1].tp[3] = 0;

        lut->groups[2].tp[0] = 0;
        lut->groups[2].tp[1] = 0;
        lut->groups[2].tp[2] = 0;
        lut->groups[2].tp[3] = 0;

        lut->groups[3].tp[0] = 0x02;
        lut->groups[3].tp[1] = 0x0b;
        lut->groups[3].tp[2] = 0;
        lut->groups[3].tp[3] = 0;

        lut->groups[4].tp[0] = 0;
        lut->groups[4].tp[1] = 0;
        lut->groups[4].tp[2] = 0;
        lut->groups[4].tp[3] = 0;

        lut->groups[5].tp[0] = 0;
        lut->groups[5].tp[1] = 0;
        lut->groups[5].tp[2] = 0;
        lut->groups[5].tp[3] = 0;
        break;
    }
    hink_set_lut(&epaper, (uint8_t *)lut);
}

void framenametag(void)
{
    LUTset(Lut1s);
    pax_background(&gfx, 0);
    if (specialcharacterselect == 0 || specialcharacterselect == 1)
        pax_draw_text(&gfx, 1, pax_font_saira_regular, 30, 80, 50, playername);
    DisplaySwitchesBox(SWITCH_1);
    pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 8, 116, "Exit");
    DisplaySwitchesBox(SWITCH_3);
    pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 133, 116, specialcharactersicon[specialcharacterselect]);
    DisplaySwitchesBox(SWITCH_5);
    pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 247, 116, "delete");
    if (specialcharacterselect == 2)
    {
        int _position = 90;
        DisplayTelegraph(EPAPER_BLACK, _position);
        int _offsetX = 5;
        int _offsetY = 5;
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 12 - _offsetY, "@");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 27 - _offsetY, "#");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 27 - _offsetY, "$");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 16 - _offsetX, 42 - _offsetY, "_");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 42 - _offsetY, "&");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 16 - _offsetX, 42 - _offsetY, "-");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 24 - _offsetX, 57 - _offsetY, "+");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 57 - _offsetY, "(");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 57 - _offsetY, ")");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 24 - _offsetX, 57 - _offsetY, "/");

        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 116 - _offsetY, "|");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 101 - _offsetY, "~");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 101 - _offsetY, "`");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 16 - _offsetX, 86 - _offsetY, ";");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 86 - _offsetY, "!");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 16 - _offsetX, 86 - _offsetY, "?");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 24 - _offsetX, 71 - _offsetY, "*");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 71 - _offsetY, "\"");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 71 - _offsetY, "'");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 24 - _offsetX, 71 - _offsetY, ":");
    }

    if (specialcharacterselect == 3)
    {
        int _position = 90;
        DisplayTelegraph(EPAPER_BLACK, _position);
        int _offsetX = 5;
        int _offsetY = 5;
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 12 - _offsetY, "=");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 27 - _offsetY, "[");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 27 - _offsetY, "]");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 16 - _offsetX, 42 - _offsetY, "\\");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 42 - _offsetY, "{");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 16 - _offsetX, 42 - _offsetY, "}");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 24 - _offsetX, 57 - _offsetY, "<");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 57 - _offsetY, ">");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 57 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 24 - _offsetX, 57 - _offsetY, "");

        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 116 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 101 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 101 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 16 - _offsetX, 86 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - _offsetX, 86 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 16 - _offsetX, 86 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 24 - _offsetX, 71 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position - 8 - _offsetX, 71 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 8 - _offsetX, 71 - _offsetY, "");
        pax_draw_text(&gfx, EPAPER_BLACK, pax_font_sky_mono, 10, _position + 24 - _offsetX, 71 - _offsetY, "");
    }
    hink_write(&epaper, gfx.buf);
}

