badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
void app_main(void) {
    esp_err_t res = initialize_system();
    if (res != ESP_OK) {
        // Device init failed, stop.
        ESP_LOGE(TAG, "System init failed, bailing out.");
        return;
    }

    if (card) {
        sdmmc_card_print_info(stdout, card);
    } else {
        ESP_LOGI(TAG, "No SD card found");
    }

    LUTset(Lut4s);

    bool          state           = false;
    unsigned long previous_millis = 0;

    xTaskCreate(testaa, "testaa", 1024, NULL, 1, NULL);

    while (1) {
        bool busy = hink_busy(&epaper);

        res = i2c_read_reg(I2C_BUS, 0x42, I2C_REG_BTN, buttons, 5);
        if (res == ESP_OK) {
            if (buttons[0] | buttons[1] | buttons[2] | buttons[3] | buttons[4]) {
                printf("BUTTONS %x %x %x %x %x\n", buttons[0], buttons[1], buttons[2], buttons[3], buttons[4]);
            }
        }

        // if (!busy)
        // {
        //     unsigned long current_millis = millis();
        //     unsigned long time_passed = current_millis - previous_millis;
        //     if (previous_millis)
        //     {
        //         printf("Updating took %lu ms\n", time_passed);
        //     }
        //     previous_millis = millis();
        //     state = !state;

        //     switch (MainMenustatemachine)
        //     {
        //     case MainMenuhub:

        //         if (buttons[SWITCH_2] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuBadgetag;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }

        //         if (buttons[SWITCH_3] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuCredits;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }

        //         if (buttons[SWITCH_4] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuSettings;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }

        //         if (buttons[SWITCH_5] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenubattleship;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }
        //         if (MainMenuchangeflag == 1)
        //         {
        //             LUTset(Lut4s);
        //             pax_background(&gfx, 0);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 12, 50, 50, "Main hub");
        //             DisplaySwitchesBox(SWITCH_1);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 8, 116, " ");
        //             DisplaySwitchesBox(SWITCH_2);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 65, 116, "Nametag");
        //             DisplaySwitchesBox(SWITCH_3);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 125, 116, "Credits");
        //             DisplaySwitchesBox(SWITCH_4);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 187, 116, "Settings");
        //             DisplaySwitchesBox(SWITCH_5);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 247, 116, "battle");
        //             hink_write(&epaper, gfx.buf);
        //             MainMenuchangeflag = 0;
        //         }
        //         break;

        //     case MainMenuBadgetag:

        //         if (buttons[SWITCH_1] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuhub;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }
        //         if (buttons[SWITCH_3] == SWITCH_PRESS)
        //         {
        //             specialcharacterselect++;
        //             if (specialcharacterselect > 3)
        //                 specialcharacterselect = 0;
        //             framenametag();
        //         }
        //         // specialcharacterselect

        //         if (buttons[SWITCH_5] == SWITCH_PRESS)
        //         {
        //             playername[strlen(playername) - 1] = '\0';
        //             framenametag();
        //         }

        //         if (MainMenuchangeflag == 1)
        //         {
        //             inputletter = NULL;
        //             framenametag();
        //             MainMenuchangeflag = 0;
        //         }

        //         if (inputletter != NULL)
        //         {
        //             strncat(playername, &inputletter, 1);
        //             specialcharacterselect = 0;
        //             framenametag();
        //             inputletter = NULL;
        //         }

        //     case MainMenuSettings:
        //         if (buttons[SWITCH_1] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuhub;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }
        //         if (MainMenuchangeflag == 1)
        //         {
        //             LUTset(Lut4s);
        //             pax_background(&gfx, 0);
        //             pax_draw_text(&gfx, 1, pax_font_marker, 18, 1, 0, "Settings placeholder");
        //             DisplaySwitchesBox(SWITCH_1);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 8, 116, "Exit");
        //             // DisplaySwitchesBox(SWITCH_3);
        //             // pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 125, 116, "Online");
        //             // DisplaySwitchesBox(SWITCH_5);
        //             // pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 247, 116, "Offline");
        //             hink_write(&epaper, gfx.buf);
        //             MainMenuchangeflag = 0;
        //         }
        //         break;

        //     case MainMenuCredits:
        //         if (buttons[SWITCH_1] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuhub;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }
        //         if (MainMenuchangeflag == 1)
        //         {
        //             LUTset(Lut4s);
        //             pax_background(&gfx, 0);
        //             pax_draw_text(&gfx, 1, pax_font_marker, 18, 1, 0, "Credits placeholder");
        //             DisplaySwitchesBox(SWITCH_1);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 8, 116, "Exit");
        //             // DisplaySwitchesBox(SWITCH_3);
        //             // pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 125, 116, "Online");
        //             // DisplaySwitchesBox(SWITCH_5);
        //             // pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 247, 116, "Offline");
        //             hink_write(&epaper, gfx.buf);
        //             MainMenuchangeflag = 0;
        //         }
        //         break;

