badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
        //     case MainMenubattleship:
        //         if (buttons[SWITCH_1] == SWITCH_PRESS)
        //         {
        //             MainMenustatemachine = MainMenuhub;
        //             MainMenuchangeflag = 1;
        //             break;
        //         }
        //         if (MainMenuchangeflag == 1)
        //         {
        //             LUTset(Lut4s);
        //             pax_background(&gfx, 0);
        //             pax_draw_text(&gfx, 1, pax_font_marker, 18, 1, 0, "Battleship");
        //             DisplaySwitchesBox(SWITCH_1);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 8, 116, "Exit");
        //             DisplaySwitchesBox(SWITCH_3);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 125, 116, "Online");
        //             DisplaySwitchesBox(SWITCH_5);
        //             pax_draw_text(&gfx, 1, pax_font_sky_mono, 10, 247, 116, "Offline");
        //             hink_write(&epaper, gfx.buf);
        //             MainMenuchangeflag = 0;
        //         }

        //         break;
        //     }
        // }

        if (delayLEDflag == 0) res = TextInputTelegraph();

        gpio_set_level(
            GPIO_RELAY,
            buttons[0] | buttons[1] | buttons[2] | buttons[3] | buttons[4]
        );  // Turn on relay if one of the buttons is activated
    }
}

esp_err_t TextInputTelegraph(void)
{
    uint32_t led = 0;
    switch (buttons[SWITCH_1])
    {
    case SWITCH_LEFT:
        led |= LED_A | LED_B | LED_E | LED_H;
        break;
    case SWITCH_RIGHT:
        led |= LED_M | LED_R | LED_V | LED_Y;
        break;
    case SWITCH_PRESS:
        break;
    default:
        break;
    }

    switch (buttons[SWITCH_2])
    {
    case SWITCH_LEFT:
        led |= LED_M | LED_I | LED_F | LED_D;
        break;
    case SWITCH_RIGHT:
        led |= LED_H | LED_N | LED_S | LED_W;
        break;
    case SWITCH_PRESS:
        break;
    default:
        break;
    }

    switch (buttons[SWITCH_3])
    {
    case SWITCH_LEFT:
        led |= LED_R | LED_N | LED_K | LED_G;
        break;
    case SWITCH_RIGHT:
        led |= LED_E | LED_I | LED_O | LED_T;
        break;
    case SWITCH_PRESS:
        break;
    default:
        break;
    }

    switch (buttons[SWITCH_4])
    {
    case SWITCH_LEFT:
        led |= LED_V | LED_S | LED_O | LED_L;
        break;
    case SWITCH_RIGHT:
        led |= LED_B | LED_F | LED_K | LED_P;
        break;
    case SWITCH_PRESS:
        break;
    default:
        break;
    }

    switch (buttons[SWITCH_5])
    {
    case SWITCH_LEFT:
        led |= LED_Y | LED_W | LED_T | LED_P;
        break;
    case SWITCH_RIGHT:
        led |= LED_A | LED_D | LED_G | LED_L;
        break;
    case SWITCH_PRESS:
        break;
    default:
        break;
    }

    switch (specialcharacterselect)
    {
    case 0:
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_A);
            inputletter = 'a';
        }

        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_B);
            inputletter = 'b';
        }

        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_D);
            inputletter = 'd';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_E);
            inputletter = 'e';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_F);
            inputletter = 'f';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_G);
            inputletter = 'g';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_2] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_H);
            inputletter = 'h';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_I);
            inputletter = 'i';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_K);
            inputletter = 'k';
        }
        if (buttons[SWITCH_4] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_L);
            inputletter = 'l';
        }

        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_2] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_M);
            inputletter = 'm';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_N);
            inputletter = 'n';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_O);
            inputletter = 'o';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_P);
            inputletter = 'p';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_R);
            inputletter = 'r';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_S);
            inputletter = 's';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_T);
            inputletter = 't';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_V);
            inputletter = 'v';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_W);
            inputletter = 'w';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_Y);
            inputletter = 'y';
        }

