badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_LEFT) // C
        {
            led = DisplaySelectedLetter(LED_E) + LED_G + LED_F + LED_H + LED_M + LED_R + LED_S + LED_T;
            inputletter = 'c';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_LEFT) // J
        {
            led = DisplaySelectedLetter(LED_E) + LED_F + LED_G + LED_K + LED_O + LED_R + LED_S + LED_M;
            inputletter = 'j';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // Q
        {
            led = DisplaySelectedLetter(LED_E) + LED_H + LED_M + LED_R + LED_S + LED_O + LED_K + LED_F + LED_T;
            inputletter = 'q';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // U
        {
            led = DisplaySelectedLetter(LED_H) + LED_M + LED_R + LED_S + LED_T + LED_P + LED_L;
            inputletter = 'u';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // X
        {
            led = DisplaySelectedLetter(LED_E) + LED_I + LED_G + LED_K + LED_N + LED_R + LED_O + LED_T;
            inputletter = 'x';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // Z
        {
            led = DisplaySelectedLetter(LED_E) + LED_F + LED_G + LED_K + LED_N + LED_R + LED_S + LED_T;
            inputletter = 'z';
        }
        break;

    case 1: // CAPS letter
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_A);
            inputletter = 'A';
        }

        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_B);
            inputletter = 'B';
        }

        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_D);
            inputletter = 'D';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_E);
            inputletter = 'E';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_F);
            inputletter = 'F';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_G);
            inputletter = 'G';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_2] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_H);
            inputletter = 'H';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_I);
            inputletter = 'I';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_K);
            inputletter = 'K';
        }
        if (buttons[SWITCH_4] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_L);
            inputletter = 'L';
        }

        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_2] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_M);
            inputletter = 'M';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_N);
            inputletter = 'N';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_O);
            inputletter = 'O';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_P);
            inputletter = 'P';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_R);
            inputletter = 'R';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_S);
            inputletter = 'S';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_T);
            inputletter = 'T';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_V);
            inputletter = 'V';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_W);
            inputletter = 'W';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_Y);
            inputletter = 'Y';
        }

        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_LEFT) // C
        {
            led = DisplaySelectedLetter(LED_E) + LED_G + LED_F + LED_H + LED_M + LED_R + LED_S + LED_T;
            inputletter = 'C';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_LEFT) // J
        {
            led = DisplaySelectedLetter(LED_E) + LED_F + LED_G + LED_K + LED_O + LED_R + LED_S + LED_M;
            inputletter = 'J';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // Q
        {
            led = DisplaySelectedLetter(LED_E) + LED_H + LED_M + LED_R + LED_S + LED_O + LED_K + LED_F + LED_T;
            inputletter = 'Q';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // U
        {
            led = DisplaySelectedLetter(LED_H) + LED_M + LED_R + LED_S + LED_T + LED_P + LED_L;
            inputletter = 'U';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // X
        {
            led = DisplaySelectedLetter(LED_E) + LED_I + LED_G + LED_K + LED_N + LED_R + LED_O + LED_T;
            inputletter = 'X';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_RIGHT) // Z
        {
            led = DisplaySelectedLetter(LED_E) + LED_F + LED_G + LED_K + LED_N + LED_R + LED_S + LED_T;
            inputletter = 'Z';
        }
        break;
    case 2: // symbols 1
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_A);
            inputletter = '@';
        }

