badgeteam/hackerhotel-2024-firmware-esp32c6/main/main.c
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_B);
            inputletter = '#';
        }

        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_D);
            inputletter = '$';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_E);
            inputletter = '_';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_F);
            inputletter = '&';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_G);
            inputletter = '-';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_2] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_H);
            inputletter = '+';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_I);
            inputletter = '(';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_K);
            inputletter = ')';
        }
        if (buttons[SWITCH_4] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_L);
            inputletter = '/';
        }

        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_2] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_M);
            inputletter = '*';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_N);
            inputletter = '"';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_O);
            inputletter = '\'';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_P);
            inputletter = ':';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_R);
            inputletter = ';';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_S);
            inputletter = '!';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_T);
            inputletter = '?';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_V);
            inputletter = '~';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_W);
            inputletter = '`';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_Y);
            inputletter = '|';
        }
        break;
    case 3: // symbols 2
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_A);
            inputletter = '=';
        }

        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_B);
            inputletter = '[';
        }

        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_D);
            inputletter = ']';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_E);
            inputletter = '\\';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_F);
            inputletter = '{';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_G);
            inputletter = '}';
        }
        if (buttons[SWITCH_1] == SWITCH_LEFT && buttons[SWITCH_2] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_H);
            inputletter = '<';
        }
        if (buttons[SWITCH_2] == SWITCH_LEFT && buttons[SWITCH_3] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_I);
            inputletter = '>';
        }
        if (buttons[SWITCH_3] == SWITCH_LEFT && buttons[SWITCH_4] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_K);
            inputletter = ' ';
        }
        if (buttons[SWITCH_4] == SWITCH_LEFT && buttons[SWITCH_5] == SWITCH_RIGHT)
        {
            led = DisplaySelectedLetter(LED_L);
            inputletter = ' ';
        }

        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_2] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_M);
            inputletter = ' ';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_N);
            inputletter = ' ';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_O);
            inputletter = ' ';
        }
        if (buttons[SWITCH_4] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_P);
            inputletter = ' ';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_3] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_R);
            inputletter = ' ';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_S);
            inputletter = ' ';
        }
        if (buttons[SWITCH_3] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_T);
            inputletter = ' ';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_4] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_V);
            inputletter = ' ';
        }
        if (buttons[SWITCH_2] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_W);
            inputletter = ' ';
        }
        if (buttons[SWITCH_1] == SWITCH_RIGHT && buttons[SWITCH_5] == SWITCH_LEFT)
        {
            led = DisplaySelectedLetter(LED_Y);
            inputletter = ' ';
        }
        break;
    }

    esp_err_t _res = i2c_write_reg_n(I2C_BUS, 0x42, 0, (uint8_t *)&led, sizeof(uint32_t));
    if (_res != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to write to CH23 coprocessor (%d)\n", _res);
    }
    return _res;
}